# DefinitionGroups Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionGroups Class
Members See Also
---
A specialized set of definition groups that allows creation of new groups.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DefinitionGroups : IEnumerable<DefinitionGroup>,
	IDisposable
```

Visual Basic
---
```text
Public Class DefinitionGroups _
	Implements IEnumerable(Of DefinitionGroup), IDisposable
```

Visual C++
---
```text
public ref class DefinitionGroups : IEnumerable<DefinitionGroup^>,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DefinitionGroups
# See Also
DefinitionGroups Members
Autodesk.Revit.DB Namespace